1s/ERP/Conf/Catalogs/Лико_Паллеты2_0.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_Паллеты2_0</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ТипыПаллет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/AccumulationRegisters/Лико_ТоварыНаПаллетах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Лико_ТоварыНаПаллетах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Паллет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Паллеты2_0</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

1s/ERP/Conf/InformationRegisters/Лико_ПараметрыПаллет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_ПараметрыПаллет</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Типоразмер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ТипоразмерыПаллет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Паллет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Паллеты2_0</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_Паллеты2_0/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс

Функция ШтрихКод(ПаллетСсылка) Экспорт 
	
	Перем ШК;
	
	ВидИнформации = 2; 
	ФВидИнформации = Формат(ВидИнформации, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=0");

	
	ФКод = Формат(ПаллетСсылка.Код, "ЧЦ=10; ЧВН=; ЧГ=");	
	ШК = "8" + ФВидИнформации + ФКод;


	КонтольныйСимвол = Лико_Дополнительно.ПосчитатьКонтрольнуюСуммуШК(ШК);	

	
	ШК = ШК + КонтольныйСимвол;
	
	Возврат ШК;

	
	
КонецФункции

Функция ШтрихКодСтрокой(ПаллетСсылка) Экспорт
	
	Перем ШК;
	ВидИнформации = 2;
	
	
	ФВидИнформации = Формат(ВидИнформации, "ЧЦ=2; ЧН=00; ЧВН=; ЧГ=0");
	
	ФКод = Формат(ПаллетСсылка.Код, "ЧЦ=10; ЧН=0000000000; ЧВН=; ЧГ=0"); // 7 символов код объекта номенклатуры
	
	Разделитель = " ";
	
	ШК = "8"+ ФВидИнформации
	+ ФКод;
	
	ШКСтрокой = "8"+ ФВидИнформации + Разделитель
	+ ФКод;
	
	КонтольныйСимвол = Лико_Дополнительно.ПосчитатьКонтрольнуюСуммуШК(ШК);
	ШК = ШК + КонтольныйСимвол;
	ШКСтрокой = ШКСтрокой + Разделитель + КонтольныйСимвол;
	
	Возврат ШКСтрокой;
КонецФункции //ПолучитьКороткийШтрихКод Экспорт

Функция СерииНаПаллете(Паллет, Дата = Неопределено) Экспорт 
    УстановитьПривилегированныйРежим(Истина);
	
	Если Дата = Неопределено Тогда 
		Дата = Дата('39991231');
	
	КонецЕсли;
	
  
    // Один запрос для получения остатков паллет для всех серий из документа
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |	ТоварыНаПаллетахОстатки.Серия КАК Серия,
    |	ТоварыНаПаллетахОстатки.Паллет КАК Паллет,
    |	ТоварыНаПаллетахОстатки.КоличествоОстаток КАК Количество
    |ИЗ
    |	РегистрНакопления.Лико_ТоварыНаПаллетах.Остатки(&ДатаДокумента, Паллет = &Паллет) КАК ТоварыНаПаллетахОстатки
    |
    |УПОРЯДОЧИТЬ ПО
    |	Серия,
    |	Количество УБЫВ";

    Запрос.УстановитьПараметр("ДатаДокумента", Дата);
    Запрос.УстановитьПараметр("Паллет", Паллет);

    Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Серия");
   

	
	
КонецФункции

// Получает остатки товаров в ячейках по указанным сериям на указанную дату
// Из таблицы товаров берется только серия, все остальные данные - из регистра остатков
//
// Параметры:
//  ДанныеТоваров - ТаблицаЗначений, Массив, Структура - данные о товарах
//                  ТаблицаЗначений: колонки Серия, НомерСтроки
//                  Массив: массив ссылок на СерииНоменклатуры
//                  Структура: ключи Серия (или Серии как массив), НомерСтроки (необязательно)
//  ДатаДокумента - Дата - дата, на которую получаются остатки
//
// Возвращаемое значение:
//  ТаблицаЗначений - колонки:
//    * Номенклатура - СправочникСсылка.Номенклатура (из регистра)
//    * Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры (из регистра)
//    * Упаковка - СправочникСсылка.УпаковкиЕдиницыИзмерения (из регистра)
//    * Серия - СправочникСсылка.СерииНоменклатуры (из документа)
//    * Ячейка - СправочникСсылка.СкладскиеЯчейки (из регистра)
//    * НомерСтроки - Число
//    * ВНаличииОстаток - Число
//    * КоличествоКПеремещению - Число
//
// Примеры:
//  // Из табличной части документа
//  Остатки = Справочники.Лико_Паллеты2_0.ПолучитьОстаткиТоваровПоСериямВЯчейках(Товары.Выгрузить(), ТекущаяДата());
//  
//  // Из массива серий
//  МассивСерий = Новый Массив;
//  МассивСерий.Добавить(Серия1);
//  МассивСерий.Добавить(Серия2);
//  Остатки = Справочники.Лико_Паллеты2_0.ПолучитьОстаткиТоваровПоСериямВЯчейках(МассивСерий, ТекущаяДата());
//  
//  // Из структуры
//  Параметры = Новый Структура("Серии, НомерСтроки", МассивСерий, 1);
//  Остатки = Справочники.Лико_Паллеты2_0.ПолучитьОстаткиТоваровПоСериямВЯчейках(Параметры, ТекущаяДата());
//
Функция ПолучитьОстаткиТоваровПоСериямВЯчейках(ДанныеТоваров, ДатаДокумента) Экспорт
    
    // Преобразуем входные данные в унифицированную таблицу через адаптер
    ТаблицаТоваров = ПреобразоватьДанныеТоваровВТаблицу(ДанныеТоваров);
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	ТоварыДокумента.Серия КАК Серия,
    |	ТоварыДокумента.НомерСтроки КАК НомерСтроки
    |ПОМЕСТИТЬ ТоварыДокумента
    |ИЗ
    |	&ТоварыДокумента КАК ТоварыДокумента
    |;
    |
    |////////////////////////////////////////////////////////////////////////////////
    |ВЫБРАТЬ
    |	ТоварыВЯчейкахОстатки.Номенклатура КАК Номенклатура,
    |	ТоварыВЯчейкахОстатки.Характеристика КАК Характеристика,
    |	ТоварыВЯчейкахОстатки.Упаковка КАК Упаковка,
    |	ТоварыДокумента.Серия КАК Серия,
    |	ТоварыВЯчейкахОстатки.Ячейка КАК Ячейка,
    |	ТоварыДокумента.НомерСтроки КАК НомерСтроки,
    |	ТоварыВЯчейкахОстатки.ВНаличииОстаток КАК ВНаличииОстаток,
    |	ТоварыВЯчейкахОстатки.ВНаличииОстаток КАК КоличествоКПеремещению
    |ИЗ
    |	ТоварыДокумента КАК ТоварыДокумента
    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(
    |			&ДатаДокумента,
    |			Серия В (ВЫБРАТЬ РАЗЛИЧНЫЕ ТД.Серия ИЗ ТоварыДокумента КАК ТД)
    |		) КАК ТоварыВЯчейкахОстатки
    |		ПО ТоварыДокумента.Серия = ТоварыВЯчейкахОстатки.Серия
    |ГДЕ
    |	ТоварыВЯчейкахОстатки.ВНаличииОстаток > 0
    |
    |УПОРЯДОЧИТЬ ПО
    |	НомерСтроки,
    |	Номенклатура,
    |	Характеристика,
    |	Ячейка";
    
    Запрос.УстановитьПараметр("ТоварыДокумента", ТаблицаТоваров);
    Запрос.УстановитьПараметр("ДатаДокумента", ДатаДокумента);
    
    Возврат Запрос.Выполнить().Выгрузить();
    
КонецФункции

// Преобразует различные типы данных о товарах в унифицированную таблицу значений
// Функция-адаптер для поддержки разных форматов входных данных
//
// Параметры:
//  ДанныеТоваров - ТаблицаЗначений, Массив, Структура - исходные данные
//
// Возвращаемое значение:
//  ТаблицаЗначений - унифицированная таблица с колонками Серия, НомерСтроки
//
Функция ПреобразоватьДанныеТоваровВТаблицу(ДанныеТоваров) Экспорт
    
    ТипДанных = ТипЗнч(ДанныеТоваров);
    
    // Если уже таблица значений - возвращаем как есть
    Если ТипДанных = Тип("ТаблицаЗначений") Тогда
        Возврат ДанныеТоваров;
    КонецЕсли;
    
    // Создаем новую таблицу
    Таблица = Новый ТаблицаЗначений;
    Таблица.Колонки.Добавить("Серия", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
    Таблица.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
    
    // Преобразуем массив в таблицу
    Если ТипДанных = Тип("Массив") Тогда
        Возврат ПреобразоватьМассивВТаблицу(ДанныеТоваров, Таблица);
    КонецЕсли;
    
    // Преобразуем структуру в таблицу
    Если ТипДанных = Тип("Структура") ИЛИ ТипДанных = Тип("Соответствие") Тогда
        Возврат ПреобразоватьСтруктуруВТаблицу(ДанныеТоваров, Таблица);
    КонецЕсли;
    
    // Если тип не поддерживается - возвращаем пустую таблицу
    Возврат Таблица;
    
КонецФункции

// Преобразует массив серий в таблицу значений
//
// Параметры:
//  Массив - Массив из СправочникСсылка.СерииНоменклатуры
//  Таблица - ТаблицаЗначений - таблица для заполнения
//
// Возвращаемое значение:
//  ТаблицаЗначений - заполненная таблица
//
Функция ПреобразоватьМассивВТаблицу(Массив, Таблица)
    
    НомерСтроки = 0;
    Для Каждого Серия Из Массив Цикл
        НомерСтроки = НомерСтроки + 1;
        НоваяСтрока = Таблица.Добавить();
        НоваяСтрока.Серия = Серия;
        НоваяСтрока.НомерСтроки = НомерСтроки;
    КонецЦикла;
    
    Возврат Таблица;
    
КонецФункции

// Преобразует структуру с данными о сериях в таблицу значений
//
// Параметры:
//  Структура - Структура - структура с ключами:
//              * Серия или Серии - СправочникСсылка.СерииНоменклатуры или Массив
//              * НомерСтроки - Число (необязательно)
//  Таблица - ТаблицаЗначений - таблица для заполнения
//
// Возвращаемое значение:
//  ТаблицаЗначений - заполненная таблица
//
Функция ПреобразоватьСтруктуруВТаблицу(Структура, Таблица)
    
    // Ищем данные о сериях в структуре
    Серии = Неопределено;
    Если Структура.Свойство("Серии", Серии) Тогда
        // Если серии переданы как массив
        Если ТипЗнч(Серии) = Тип("Массив") Тогда
            Возврат ПреобразоватьМассивВТаблицу(Серии, Таблица);
        Иначе
            // Если одна серия
            НоваяСтрока = Таблица.Добавить();
            НоваяСтрока.Серия = Серии;
            НоваяСтрока.НомерСтроки = 1;
            Если Структура.Свойство("НомерСтроки") Тогда
                НоваяСтрока.НомерСтроки = Структура.НомерСтроки;
            КонецЕсли;
        КонецЕсли;
    ИначеЕсли Структура.Свойство("Серия", Серии) Тогда
        // Если серия передана как единичное значение
        НоваяСтрока = Таблица.Добавить();
        НоваяСтрока.Серия = Серии;
        НоваяСтрока.НомерСтроки = 1;
        Если Структура.Свойство("НомерСтроки") Тогда
            НоваяСтрока.НомерСтроки = Структура.НомерСтроки;
        КонецЕсли;
    КонецЕсли;
    
    Возврат Таблица;
    
КонецФункции


Функция ПроверитьНаличиеОстатков(ТаблицаОстатков, ДанныеТоваров = Неопределено) Экспорт
	
	

	
    Результат = Новый Структура;
    Результат.Вставить("ОстаткиДостаточны", Истина);
    Результат.Вставить("СтрокиБезОстатков", Новый Массив);
    Результат.Вставить("ТекстЗаголовка", "");
    Результат.Вставить("СообщенияПоСтрокам", Новый Массив);
    Результат.Вставить("ТекстПричин", "");
    
    // Если таблица товаров не передана, выполняем простую проверку на пустоту
    Если ДанныеТоваров = Неопределено Тогда
        
        Если ТаблицаОстатков.Количество() = 0 Тогда
            Результат.ОстаткиДостаточны = Ложь;
            Результат.ТекстЗаголовка = "Не найдены остатки товаров с указанными сериями в ячейках";
            
            Результат.ТекстПричин = 
                "Возможные причины:" + Символы.ПС +
                "  • Серии не поступали на склад" + Символы.ПС +
                "  • Серии уже были полностью перемещены/отгружены" + Символы.ПС +
                "  • Неправильно указаны серии в документе";
        КонецЕсли;
        
        Возврат Результат;
        
	КонецЕсли;
	
	ТаблицаТоваров = ПреобразоватьДанныеТоваровВТаблицу(ДанныеТоваров);
    
    // Проверяем наличие остатков для каждой серии из документа
    СерииБезОстатков = Новый Массив;
    
    Для Каждого СтрокаТовара Из ТаблицаТоваров Цикл
        
        Если НЕ ЗначениеЗаполнено(СтрокаТовара.Серия) Тогда
            Продолжить;
        КонецЕсли;
        
        // Ищем остатки для данной серии
        НайденныеОстатки = ТаблицаОстатков.НайтиСтроки(Новый Структура("Серия, НомерСтроки", СтрокаТовара.Серия, СтрокаТовара.НомерСтроки));
        
        Если НайденныеОстатки.Количество() = 0 Тогда
            // Для этой серии нет остатков
            СерииБезОстатков.Добавить(СтрокаТовара);
        КонецЕсли;
        
    КонецЦикла;
    
    // Если найдены серии без остатков, формируем ошибку
    Если СерииБезОстатков.Количество() > 0 Тогда
        
        Результат.ОстаткиДостаточны = Ложь;
        Результат.ТекстЗаголовка = "Не найдены остатки товаров с указанными сериями в ячейках";
        
        // Формируем отдельные сообщения для каждой серии без остатков
        Для Каждого СтрокаТовара Из СерииБезОстатков Цикл
            
            ДанныеСообщения = Новый Структура;
            ДанныеСообщения.Вставить("ИндексСтроки", СтрокаТовара.НомерСтроки - 1); // Индекс с 0
            ДанныеСообщения.Вставить("Текст", 
                "Строка " + Формат(СтрокаТовара.НомерСтроки, "ЧГ=0") + 
                ": Нет остатков для серии """ + Строка(СтрокаТовара.Серия) + """");
            
            Результат.СообщенияПоСтрокам.Добавить(ДанныеСообщения);
            Результат.СтрокиБезОстатков.Добавить(СтрокаТовара.НомерСтроки);
            
        КонецЦикла;
        
        // Информация о возможных причинах
        Результат.ТекстПричин = 
            "Возможные причины:" + Символы.ПС +
            "  • Серии не поступали на склад" + Символы.ПС +
            "  • Серии уже были полностью перемещены/отгружены" + Символы.ПС +
            "  • Неправильно указаны серии в документе";
        
    КонецЕсли;
    
    Возврат Результат;
    
КонецФункции


// Форматирует строку ошибки для одной позиции товара
//
// Параметры:
//  НомерСтроки - Число - номер строки в документе
//  Номенклатура - СправочникСсылка.Номенклатура
//  Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры
//  Серия - СправочникСсылка.СерииНоменклатуры
//  Ячейка - СправочникСсылка.СкладскиеЯчейки
//  Остаток - Число - остаток в ячейке
//
// Возвращаемое значение:
//  Строка - форматированная строка ошибки
//
Функция ФорматироватьСтрокуОшибки(НомерСтроки, Номенклатура, Характеристика, Серия, Ячейка, Остаток) Экспорт
    
    ПредставлениеХарактеристики = ?(ЗначениеЗаполнено(Характеристика), 
        СтрШаблон(" (%1)", Характеристика), "");
    
    Возврат СтрШаблон("Строка %1: %2%3, Серия: %4, Ячейка: %5 - остаток: %6",
        НомерСтроки,
        Номенклатура,
        ПредставлениеХарактеристики,
        Серия,
        Ячейка,
        Формат(Остаток, "ЧЦ=15; ЧДЦ=3"));
    
КонецФункции

// Форматирует строку ошибки для серии без указания конкретной ячейки
//
// Параметры:
//  НомерСтроки - Число - номер строки в документе
//  Номенклатура - СправочникСсылка.Номенклатура
//  Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры
//  Серия - СправочникСсылка.СерииНоменклатуры
//  Остаток - Число - суммарный остаток серии во всех ячейках
//
// Возвращаемое значение:
//  Строка - форматированная строка ошибки
//
Функция ФорматироватьСтрокуОшибкиПоСерии(НомерСтроки, Номенклатура, Характеристика, Серия, Остаток) Экспорт
    
    ПредставлениеХарактеристики = ?(ЗначениеЗаполнено(Характеристика), 
        СтрШаблон(" (%1)", Характеристика), "");
    
    Возврат СтрШаблон("Строка %1: %2%3, Серия: %4 - остаток во всех ячейках: %5",
        НомерСтроки,
        Номенклатура,
        ПредставлениеХарактеристики,
        Серия,
        Формат(Остаток, "ЧЦ=15; ЧДЦ=3"));
    
КонецФункции


Функция ТипоразмерПаллета(Паллет) Экспорт
	
	Структура = Новый Структура;
	
	Структура.Вставить("Высота");
	Структура.Вставить("Ширина");
	Структура.Вставить("Глубина");
	Структура.Вставить("Вес"); 
	Структура.Вставить("Типоразмер");
	Структура.Вставить("Паллет");
	
	
	
	
	Результат = Справочники.СкладскиеЯчейки.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ПараметрыПаллетСрезПоследних.Паллет КАК Паллет,
	|	Лико_ПараметрыПаллетСрезПоследних.Типоразмер КАК Типоразмер,
	|	Лико_ПараметрыПаллетСрезПоследних.Типоразмер.Высота КАК Высота,
	|	Лико_ПараметрыПаллетСрезПоследних.Типоразмер.Ширина КАК Ширина,
	|	Лико_ПараметрыПаллетСрезПоследних.Типоразмер.Глубина КАК Глубина,
	|	Лико_ПараметрыПаллетСрезПоследних.Типоразмер.Вес КАК Вес
	|ИЗ
	|	РегистрСведений.Лико_ПараметрыПаллет.СрезПоследних(, Паллет = &Паллет) КАК Лико_ПараметрыПаллетСрезПоследних";
	Запрос.УстановитьПараметр("Паллет",Паллет );
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(Структура,Выборка);
		
	КонецЦикла;	
	
	
	
	Возврат Структура;
	
КонецФункции

Функция НовыйПаллет(ТипПаллета=Неопределено) Экспорт  //+Лико m.shenderov 08.04.2026
	
	НовыйСправочник=СоздатьЭлемент();
	НовыйСправочник.Заполнить(Истина);
	НовыйСправочник.Тип = ТипПаллета;
	
	Попытка
		НовыйСправочник.Записать();
	Исключение
		ОшибкаСообщение = "Ошибка при сохранении справочника Лико_Паллеты2_0: " + ОписаниеОшибки();
		ВызватьИсключение ОшибкаСообщение;
	КонецПопытки;

	
		
	Возврат НовыйСправочник.Ссылка;
	
КонецФункции //-Лико m.shenderov 08.04.2026 


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
